---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemCopeXAngle
source: html/ab24bcae-a015-e39c-b8c0-79492820c925.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemCopeXAngle Property

"Cross-section rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemCopeXAngle { get; }
```